---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGuidKey.#ctor(System.String)
source: html/1d05b4c6-589a-7b28-e94a-f53ce2a8415c.htm
---
# Autodesk.Revit.DB.IFC.IFCGuidKey.#ctor Method

Constructs a new IFCHybridGuid

## Syntax (C#)
```csharp
public IFCGuidKey(
	string ifcGuid
)
```

## Parameters
- **ifcGuid** (`System.String`) - IFC Global ID

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null